Repository: JackieXie168/ixlib
Catalog: po/*.po
Languages: de

source: Unable to evaluate expression
de: Ausdruck nicht auswertbar

source: Function not yet implemented
de: Funktion nicht implementiert

source: General error
de: Allgemeiner Fehler

source: NULL pointer encountered
de: NULL-Zeiger entdeckt

source: Invalid parameter
de: Ungueltiger Parameter

source: Index out of range
de: Index ausserhalb des zulaessigen Bereichs

source: Buffer overrun
de: Puffer-Ueberlauf

source: Buffer underrun
de: Puffer-Unterlauf

source: Item not found
de: Element nicht gefunden

source: Invalid operation
de: Ungueltige Operation

source: Dimension mismatch
de: Dimension unpassend

source: Operation cancelled
de: Operation abgebrochen

source: Unable to operate on empty set
de: Operation auf leerer Menge nicht moeglich

source: Unable to remove GC entry
de: GC-Eintrag nicht entfernbar

source: Unable to protect non-freeable entry
de: Nicht-freigebbarer GC-Eintrag jetzt schutzlos

source: Unmatched wildcard
de: Ungematchtes Jokerzeichen

source: Parameter error: wildcard
de: Parameterfehler: Wildcard

source: Path syntax error
de: Pfadsyntax-Fehler

source: Path relative or invalid
de: Pfad relativ oder ungueltig

source: Seek error
de: Zugriffsfehler

source: Read request across EOF
de: Lesezugriff ¸ber Dateiende

source: Write request across EOF
de: Schreibzugriff ¸ber Dateiende

source: Write protection violation
de: Schreibschutz-Verletzung

source: File clipping violation
de: Dateiende-Verletzung

source: Internal error
de: Interner Fehler

source: No such file or directory
de: Datei oder Verzeichnis nicht gefunden

source: Access denied
de: Zugriff verweigert

source: File exists
de: Datei existiert bereits

source: Too many open files
de: Zu viele offene Dateien

source: Out of media space
de: Kein Platz mehr auf dem Medium

source: File too big
de: Datei zu gross

source: Hardware failure
de: Hardware-Versagen

source: Path inaccessible
de: Pfad unzugreifbar

source: Continuity violation
de: Kontinuitaetsverletzung

source: Not supported
de: Nicht unterstuetzt

source: Invalid file format
de: Ungueltiges Dateiformat

source: Invalid replacement sequence
de: Ungueltige Ersetzungssequenz

source: Invalid chunk
de: Ungueltiger Chunk

source: CRC error
de: CRC-Fehler

source: instead of
de: anstatt

source: Unterminated comment
de: Nicht beendeter Kommentar

source: Cannot convert
de: Konvertierung nicht moeglich

source: Unexpected token encountered
de: Unerwartetes Token entdeckt

source: Unexpected end of file
de: Unerwartetes Dateiende

source: Cannot modify rvalue
de: RValue nicht aenderbar

source: Unknown identifier
de: Unbekannter Bezeichner

source: Unknown operator
de: Unbekannter Operator

source: Invalid non-local exit
de: Unbekannter nicht-lokaler Ausgang

source: Invalid number of arguments
de: Ungueltige Argumenteanzahl

source: Invalid token encountered
de: Ungueltiges Token entdeckt

source: Cannot redeclare identifier
de: Bezeichner kann nicht redeklariert werden

source: Constructor called on constructed object
de: Konstruktor an existierendem Objekt aufgerufen

source: No superclass available
de: Keine Superklasse vorhanden

source: '(' in switch statement
de: '(' in switch-Anweisung

source: ')' in switch statement
de: ')' in switch-Anweisung

source: '{' in switch statement
de: '{' in switch-Anweisung

source: '}' in switch statement
de: '}' in switch-Anweisung

source: variable identifier
de: Variablenbezeichner

source: constant identifier
de: Konstantenbezeichner

source: initializer for constant
de: Konstanten-Initialisierer

source: function identifier
de: Funktionsbezeichner

source: '(' in function declaration
de: '(' in Funktionsdeklaration

source: parameter identifier
de: Parameter-Bezeichner

source: ')' in function declaration
de: ')' in Funktionsdeklaration

source: '{' in function definition
de: '{' in Funktionsdefinition

source: method identifier
de: Methoden-Bezeichner

source: '(' in method declaration
de: '(' in Methodendeklaration

source: ')' in method declaration
de: ')' in Methodendeklaration

source: '{' in method definition
de: '{' in Methodendefinition

source: constructor identifier
de: Konstruktorbezeichner

source: class identifier
de: Klassenbezeichner

source: '(' in constructor declaration
de: '(' in Konstruktordeklaration

source: ')' in constructor declaration
de: ')' in Konstruktordeklaration

source: '{' in constructor definition
de: '{' in Konstruktordefinition

source: '{' in class declaration
de: '(' in Klassendeklaration

source: 'function' keyword
de: Schl¸sselwort 'function'

source: '(' in if statement
de: '(' in if-Anweisung

source: ')' in if statement
de: ')' in if-Anweisung

source: '(' in while statement
de: '(' in while-Anweisung

source: ')' in while statement
de: ')' in while-Anweisung

source: 'while' in do-while
de: 'while' in do-while-Anweisung

source: '(' in do-while statement
de: ')' in do-while-Anweisung

source: ')' in do-while statement
de: ')' in do-while-Anweisung

source: '(' in for statement
de: '(' in for-Anweisung

source: ')' in for statement
de: ')' in for-Anweisung

source: ';' in for statement
de: ';' in for-Anweisung

source: break label
de: break-Marke

source: continue label
de: continue-Marke

source: '(' in 'new' expression
de: '(' in new-Ausdruck

source: ')' in 'new' expression
de: ')' in new-Ausdruck

source: ')' in function call
de: ')' in Funktionsaufruf

source: ']' in subscript
de: ']' in Indizierung

source: -> int
de: -> Ganzzahl

source: -> float
de: -> Flieﬂkommazahl

source: -> bool
de: -> Wahrheitswert

source: : duplication
de: : Duplizierung

source: : lookup of
de: : Lookup von

source: : subscript
de: : Indizierung

source: : call
de: : Aufruf

source: : construction
de: : Konstruktion

source: on
de: auf

source: prefix ++
de: Pr‰fix ++

source: prefix --
de: Pr‰fix --

source: unary +
de: Un‰res +

source: unary -
de: Un‰res -

source: integer
de: Ganzzahl

source: floating point
de: Flieﬂkommazahl

source: function
de: Funktion

source: object
de: Objekt

source: built-in object
de: eingebautes Objekt

source: host object
de: Host-Objekt

source: scope
de: G¸ltigkeitsbereich

source: bound method
de: gebundene Methode

source: type
de: Typ

source: unknown value type
de: unbekannter Wertetyp

source: by assignment
de: durch Zuweisung

source: Invalid quantifier
de: Ungueltiger Quantifizierer

source: Unbalanced backreference
de: Unausgeglichene Backreference

source: Invalid escape sequence
de: Ungueltige Escape-Sequenz

source: Invalid backreference
de: Ungueltige Backreference

source: Unterminated character class
de: Nicht beendete Zeichenklasse

source: Unable to match without expression
de: Ohne Muster kann nicht gematcht werden

source: Unknown token
de: Unbekanntes Token

source: End of input
de: Ende der Eingabe

source: Syntax error
de: Syntax-Fehler

source: No text expected in this context
de: Kein Text in diesem Kontext erwartet

source: No literal expected in this context
de: Kein Literal in diesem Kontext erwartet

source: Literal expected
de: Literal erwartet

source: Unexpected end of input
de: Unerwartetes Eingabeende

source: Close tag expected
de: Schlieﬂendes Tag erwartet

source: Close tag has different name
de: Abweichender Name in schlieﬂendem Tag
